Laravel-Exception/app/Http/Controllers/Auth/RegisterController.php

INSERT INTO `users` (`name`, `email`, `password`, `updated_at`, `created_at`) VALUES ('Uma Joyce', 'lojoqahu@mailinator.com', '$2y$10$xD37nQEX0K8/HGq2jXBfZOuHp1JC.EgQjNnlB3b1sMSueVXJ8b7Je', '2023-02-18 04:04:15', '2023-02-18 04:04:15')
---
    protected function create(array $data)
    {

        return User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
        ]);