Laravel-Exception/app/Http/Controllers/AccountController.php

    public function store(Request $request)
    {
        Account::create([
           'user_id' => Auth()->user()->id,
           'balance' => $request->input('amountAccount')
        ]);
---
INSERT INTO `user_accounts` (`user_id`, `balance`, `updated_at`, `created_at`) VALUES (9, '1000000000', '2023-02-21 05:10:21', '2023-02-21 05:10:21')