Laravel-Exception/app/Http/Controllers/HomeController.php

    public function index()
    {
        $user = User::with('transaction')
            ->where('id', Auth::user()->id)
            ->first();

//        dd($dd = $user->transaction->where('ammount', '>', request('search')));

//      dd($user->transaction->where('description', 'like', '%' . request('search') . '%'));


        if(request('search')) {
            $user = $user->transaction->where('ammount', '>', request('search'));
---
SELECT * FROM `users` WHERE `id` = 9 LIMIT 1
SELECT `transactions`.*, `user_accounts`.`user_id` as `laravel_through_key` FROM `transactions` inner join `user_accounts` on `user_accounts`.`id` = `transactions`.`account_id` WHERE `user_accounts`.`user_id` in (9)
SELECT `transactions`.*, `user_accounts`.`user_id` as `laravel_through_key` FROM `transactions` inner join `user_accounts` on `user_accounts`.`id` = `transactions`.`account_id` WHERE `user_accounts`.`user_id` in (7)