Laravel-Exception/app/Http/Controllers/TransactionController.php

SELECT * FROM `user_accounts` WHERE `user_id` = '8' LIMIT 1
INSERT INTO `transactions` (`account_id`, `ammount`, `description`, `updated_at`, `created_at`) VALUES (8, 14800, 'Eum nihil dolores bread', '2023-02-20 19:35:23', '2023-02-20 19:35:23')
UPDATE `user_accounts` SET `balance` = 999976800, `user_accounts`.`updated_at` = '2023-02-20 19:35:23' WHERE `id` = 8
---
    public function store(Request $request)
    {

        $account = Account::where('user_id', $request->input('user_id'))->first();

        if(!$account) {
            return back()->withErrors(['account' => 'Account not found']);
        }

        $transactionAmount = $request->input('ammount') * 200;


        \DB::transaction(function () use($account, $transactionAmount, $request) {
            Transaction::create([
                'account_id' => $account->id,
                'ammount' => $transactionAmount,
                'description' => $request->input('description')
            ]);

            $account->balance = $account->balance - $transactionAmount;
            $account->save();