Laravel-Exception/app/Http/Controllers/UsersController.php

SELECT * FROM `users` WHERE `id` = '1' LIMIT 1
---
    public function show($id)
    {
        try {

            $user = User::where('id', $id)->firstOrFail();